Procedure of Machine Learning
1.Data Ingestion
2.EDA
3.Processing(Feature Engineering)
4.Model Building
5.Model Evaluation

For Data collection / processing we use different libraries such as:
1.Pandas
2.Numpy
3.Seaborn - data visualization
4.Matplotlib - data visualization
5.scikit learning - model building 
6.Tensor Flow / Pytorch / Open Cv / NLTK - Deep Learning
7- Dask , SparkDf

Pandas:
-it is a dataframe means we can read / create / load data.
-it is a 2-D dataset and perform different operations like:

1- load data in csv , xml , json( javascript notation) , Html
2-Operations include:
-data cleaning
-data selection
-data filtering
-data aggregation
-data transformation

In [3]:
# How to create a dataframe
import pandas as pd
data_frame = pd.DataFrame() #creating a empty dataframe

In [4]:
# Creating a dataframe From list
data = [1,2,3,4,5]
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
data2 = [ ["adi",21],["aditi",21],["rohan",21] ]
pd.DataFrame(data2)

       0   1
0    adi  21
1  aditi  21
2  rohan  21

In [12]:
# Assigning Columns Names
data2 = [ ["adi",21],["aditi",21],["rohan",21] ]
pd.DataFrame(data2 , columns =["Name" , "Age"  ] )

    Name  Age
0    adi   21
1  aditi   21
2  rohan   21

In [15]:
# Creating a dataframe from dictionary (list in dictionaruy)
dict1 = {  "Name" : [ "aditya" , "rohan" , "something"] , "Age":[21 , 22 , 30] }
pd.DataFrame(dict1)

        Name  Age
0     aditya   21
1      rohan   22
2  something   30

In [16]:
# Creating a dictionary dataframe (dict in list)
dict2 = [ {"col1" : 29 , "col2" : 20} , {"col1" : 21 , "col2": 34} ]
pd.DataFrame(dict2)

   col1  col2
0    29    20
1    21    34

In [20]:
#Renaming indexes
result = pd.DataFrame (dict2 , columns = ["col1" , "col2"] , index = ["first","second"] )
print(result)

        col1  col2
first     29    20
second    21    34

In [24]:
#How to read a csv file
pd.read_csv("test.csv")

  age@name@rollno
0   21@aditya@133
1    21@aditi@132
2     22@rohan@02

In [25]:
#Separator
pd.read_csv("test.csv",sep='@')

   age    name  rollno
0   21  aditya     133
1   21   aditi     132
2   22   rohan       2

In [37]:
# How to read from html
! pip install lxml

Collecting lxml
  Downloading lxml-5.1.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (8.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.0/8.0 MB 54.6 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-5.1.0

In [39]:
url = 'https://archive.ics.uci.edu/ml/datasets/iris'
# Read HTML tables into a list of DataFrames
tables = pd.read_html(url)

# Assuming the first table contains the data you're interested in
df = tables[0]

# Display the DataFrame
print(df)

  Variable Name     Role         Type  Demographic  \
0  sepal length  Feature   Continuous          NaN
1   sepal width  Feature   Continuous          NaN
2  petal length  Feature   Continuous          NaN
3   petal width  Feature   Continuous          NaN
4         class   Target  Categorical          NaN

                                         Description Units Missing Values
0                                                NaN    cm             no
1                                                NaN    cm             no
2                                                NaN    cm             no
3                                                NaN    cm             no
4  class of iris plant: Iris Setosa, Iris Versico...   NaN             no

In [41]:
# How to find no of rows and columns in a dataset
dict2.shape

AttributeError: 'list' object has no attribute 'shape'